const tt = [
  {
    name: "山东",
    num: 1,
    cp: ["117.194778", "36.652148"],
    up: 0,
    ch: 0,
  },
  {
    name: "黑龙江",
    num: 1,
    cp: ["126.522207", "45.801617"],
    up: 0,
    ch: 0,
  },
  {
    name: "内蒙古",
    num: 1,
    cp: ["111.785972", "40.849642"],
    up: 0,
    ch: 0,
  },
  {
    name: "吉林",
    num: 1,
    cp: ["125.326383", "43.797768"],
    up: 0,
    ch: 0,
  },
  {
    name: "广东",
    num: 1,
    cp: ["113.239359", "23.185545"],
    up: 0,
    ch: 0,
  },
  {
    name: "天津",
    num: 1,
    cp: ["117.286764", "39.001295"],
    up: 0,
    ch: 0,
  },
  {
    name: "河北",
    num: 1,
    cp: ["114.508772", "38.083783"],
    up: 0,
    ch: 0,
  },
  {
    name: "河南",
    num: 4,
    cp: ["113.644099", "34.769161"],
    up: 0,
    ch: 0,
  },
  {
    name: "浙江",
    num: 1,
    cp: ["120.211934", "30.274265"],
    up: 0,
    ch: 0,
  },
  {
    name: "湖南",
    num: 1,
    cp: ["112.926605", "28.217167"],
    up: 0,
    ch: 0,
  },
  {
    name: "安徽",
    num: 1,
    cp: ["117.194778", "31.86577"],
    up: 0,
    ch: 0,
  },
];
let a = tt
  .filter((i) => i.num !== 0)
  .sort((a, b) => b.num - a.num)
  .slice(0, 10)
  .map((i) => ({
    name: i.name,
    value: i.num,
  }));

console.log(a);
